SM_для_EDT/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоМасло</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоТопливо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаАнглийском</name>
    <comment>(рарус)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>рспбКодMDG</name>
    <comment>Рарус-СПб Бойко А.Ю.23.09.2019</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.рарусКатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Критичность</name>
    <type>
      <types>CatalogRef.впПриоритетыОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусНоменклатуры</name>
    <comment>Для реализации механизма различных блокировок SAP</comment>
    <type>
      <types>EnumRef.рспбСтатусыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <comment>makole ЗНИ РАIT-0023374</comment>
    <type>
      <types>EnumRef.ГрадацииКачества</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SM_для_EDT/src/Enums/рспбСтатусыНоменклатуры/рспбСтатусыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рспбСтатусыНоменклатуры</name>
  <enumValues>
    <name>НеЗаблокирован</name>
    <comment>ОбщиеДанныеXDTO.MSTAE = Неопределено</comment>
  </enumValues>
  <enumValues>
    <name>БлокирДляЗаготов</name>
    <comment>ОбщиеДанныеXDTO.MSTAE = &quot;01&quot;. Запрещено: Планирование потребности, Закупки</comment>
  </enumValues>
  <enumValues>
    <name>БлокирДляТехнКарты</name>
    <comment>ОбщиеДанныеXDTO.MSTAE = &quot;02&quot;. Запрещено: Использование в спецификациях и техкартах</comment>
  </enumValues>
  <enumValues>
    <name>БлокированиеДвижений</name>
    <comment>ОбщиеДанныеXDTO.MSTAE = &quot;DL&quot;. Запрещено Планирование потребности, Закупки, Прогнозирование,Использование в спецификациях и техкартах,Система управления запасами (складские движения),Сообщения\Заказы ТОРО, производственные заказы</comment>
  </enumValues>
  <enumValues>
    <name>БлокирДляСклада</name>
    <comment>ОбщиеДанныеXDTO.MSTAE = &quot;05&quot;. Запрещено Система управления запасами (складские движения),Использование в спецификациях и техкартах,Сообщения\Заказы ТОРО, производственные заказы</comment>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Catalogs/Номенклатура/Forms/ФормаВыбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("КонтролироватьВыборЗаблокированных", КонтролироватьВыборЗаблокированных);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// ++ rarus PleA 21.12.2020 [26103]
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
	ПолеЭлемента.Использование = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.СтатусНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.рспбСтатусыНоменклатуры.НеЗаблокирован;
	ОтборЭлемента.Использование = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.СтатусНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;	
	ОтборЭлемента.Использование = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЗаблокированныйРеквизитЦвет);
	
	// -- rarus PleA
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если КонтролироватьВыборЗаблокированных И ЭтоЗаблокированнаяНоменклатура(ВыбраннаяСтрока) тогда
		
		рарусНоменклатураКлиент.ВыборЗаблокированнойНоменклатуры(ЭтаФорма, ВыбраннаяСтрока, СтандартнаяОбработка);
			
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ЭтоЗаблокированнаяНоменклатура(ВыбраннаяСтрока)
	
	Возврат рарусНоменклатураСервер.ЭтоЗаблокированнаяНоменклатура(ВыбраннаяСтрока);
	
КонецФункции 

&НаКлиенте
Процедура ВыборЗаблокированнойЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> Неопределено И РезультатВопроса.Значение = "ВыбратьЗаблокированную" Тогда
		
		ОповеститьОВыбореНоменклатуры(ДополнительныеПараметры.Номенклатура);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОВыбореНоменклатуры(Номенклатура)
	
	ОповеститьОВыборе(Номенклатура);
	
КонецПроцедуры
